#################################################################################################
VERSION = "1.0"
#################################################################################################

#  Настройки для Telegram #######################################################################
TOKEN = "6956771729:AAFAs6x76X_LRsqQ9ZgLsG_sFRo_1JSlCGs"  # Токен бота
CHAT_ID = "-4083339150"  # ID целевого чата
LOG_CHAT_ID = "-4011475779"  # ID чата для логов бота

# Настройки подключения к БД ####################################################################
HOST_DB = "localhost"  # Сервер БД
USER_DB = "ost_bot"  # Пользователь БД
PASSW_DB = "aerowolf"  # Пароль БД
NAME_DB = "ostmc"  # Имя БД

# Общие настройки ###############################################################################
SILENT_MODE = False
REQUIRED_PYTHON_VERSION = "3.6"
IMAGE_PATH = "./images/"  # Папка с изображениями
PDF_PATH = "./docs/"  # Папка с документами

# Настройки поздравлений ########################################################################
NEW_YEAR = "01.01"  # Дата НГ
NEW_YEAR_FILE = "new_year"  # Имя файла открытки с НГ

OLD_NEW_YEAR = "14.01"  # Дата старого НГ
OLD_NEW_YEAR_FILE = "old_new_year"  # Имя файла открытки со старым НГ

CHRISTMAS = "07.01"  # Дата Рождества
CHRISTMAS_FILE = "christmas"  # Имя файла открытки с Рождеством

SEND_INTERVAL = 30  # Интервал отправки множественных поздравлений

# Настройки документов ##########################################################################
USTAV_FILE = "ustav"  # Имя файла с Уставом
KODEKS_FILE = "kodeks"  # Имя файла с Кодексом
